# BuiltInFailures.FormFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..FormFailures Members
BuiltInFailures..::..FormFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..FormFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddProfileFailure | Failed to Add Profile |
| DissolveNoValidInputs | No form elements selected to dissolve. |
| DissolveUnableToDissolveForm | Unable to dissolve form element. |
| FormCreationInvalidGeomCombination | Cannot remake form that is currently cut or joined to other geometry. Please uncut or unjoin first. |
| FormElemRegenFailure | Unable to create form element |
| FormElemRegenFailureError | Unable to create form element |
| FormElemRegenSelfIntersection | Unable to create form element: self-intersecting or singular geometry would result. |
| FormElemRegenSelfIntersectionReorderProfiles | This form cannot be created due to self-intersecting geometry. Clicking the Reorder Profiles button will attempt to solve this problem. |
| FormElemRegenSelfIntersectionResetConnections | This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem. |
| OpenProfileMultiSegmentSweepsNotSupported | An open profile cannot be swept along a multi-segment path. |
| VoidFormsNotUsed | Some Void Forms of this family do not cut anything and will be deleted. To make a Void Form cut something else use the Cut Geometry tool. |

# See Also
BuiltInFailures..::..FormFailures Class
Autodesk.Revit.DB Namespace